---
kind: property
id: P:Autodesk.Revit.DB.DividedPath.NumberOfPoints
source: html/001d103b-61ca-62e1-e7d4-eadaf73cfa3f.htm
---
# Autodesk.Revit.DB.DividedPath.NumberOfPoints Property

The total number of points of the divided surface.
 This combines the layout points and the intersection points.

## Syntax (C#)
```csharp
public int NumberOfPoints { get; }
```